<a href="https://colab.research.google.com/github/Ethan-Jeong/test_machinelearning/blob/master/titanic_without_onehot_LogistricRegression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [3]:
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

pclass , sex ,sibsp , parch , embarked , class , who , adult_male , embark_town , alive , alone

In [6]:
X = df[[ 'fare','pclass']]
Y = df[[ 'survived']]
X.shape , Y.shape

((891, 2), (891, 1))

In [7]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [8]:
scaler.fit(X) # 값은 가지고 있지 않고 규칙만 가지고 있게 됨

StandardScaler(copy=True, with_mean=True, with_std=True)

In [9]:
# 실제 데이터 넣어서 값을 확인하면됨
X = scaler.transform(X)
X , X.shape

(array([[-0.50244517,  0.82737724],
        [ 0.78684529, -1.56610693],
        [-0.48885426,  0.82737724],
        ...,
        [-0.17626324,  0.82737724],
        [-0.04438104, -1.56610693],
        [-0.49237783,  0.82737724]]), (891, 2))

In [10]:
# 일부 데이터 확인 하기 위해 split 한다
from sklearn.model_selection import train_test_split
x_train, x_test, y_train , y_test = train_test_split(X, Y)

In [ ]:
# 선형회귀에 실제 대입
from sklearn.linear_model import LogisticRegression
logR = LogisticRegression()
logR.fit(x_train , y_train)

In [12]:
logR.score(x_train,y_train)

0.6736526946107785